{
  "architectures": [
    "ViTDet3D"
  ],
  "attention_probs_dropout_prob": 0.0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 256,
  "image_size": [40,128,128],
  "patch_size": [4,16,16],
  "num_labels":1,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 8,
  "num_channels": 1,
  "num_hidden_layers": 6,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.34.0"
}
